# Post-secondary education analysis

Analysis goal: Examine post-secondary analysis across the US for the year 2017.

This data contains the number of students enrolled in the fall, by race/ethnicity, gender, attendance (full- or part-time) status and level of student.  Institutions with traditional academic year calendar systems (semester, quarter, trimester or  4-1-4) report their enrollment as of October 15 or the official fall reporting date of the institution for 2017. Institutions with calendar systems that differ by program or allow continuous enrollment report students that are enrolled at any time between August 1 and October 31. This data has multiple records per institution.  Records are uniquely defined by the variables IPEDS ID (ID), and the attendance status and level of student (EFALEVEL). Each instance will contain the total enrollment, enrollment for men and women, and the total enrollment and enrollment for men and women for all nine race/ethnicity categories. 

Source: www.data.gov

Author: Carlos Caballero
Data Scientist

In [42]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [43]:
# The code was removed by Watson Studio for sharing.

,UNITID,EFALEVEL,LINE,SECTION,LSTUDY,XEFTOTLT,EFTOTLT,XEFTOTLM,EFTOTLM,XEFTOTLW,...,XEFUNKNM,EFUNKNM,XEFUNKNW,EFUNKNW,XEFNRALT,EFNRALT,XEFNRALM,EFNRALM,XEFNRALW,EFNRALW
0,100654,1,29,3,4,R,6001,R,2429,R,...,R,65,R,124,R,72,R,38,R,34
1,100654,2,99,3,1,R,5038,R,2134,R,...,R,62,R,115,R,45,R,23,R,22
2,100654,3,99,3,1,R,4824,R,2038,R,...,R,54,R,106,R,43,R,22,R,21
3,100654,4,99,3,1,R,1294,R,518,R,...,R,22,R,46,R,9,R,3,R,6
4,100654,5,99,3,1,R,3530,R,1520,R,...,R,32,R,60,R,34,R,19,R,15

In [44]:
df.columns

Index(['UNITID', 'EFALEVEL', 'LINE', 'SECTION', 'LSTUDY', 'XEFTOTLT',
       'EFTOTLT', 'XEFTOTLM', 'EFTOTLM', 'XEFTOTLW', 'EFTOTLW', 'XEFAIANT',
       'EFAIANT', 'XEFAIANM', 'EFAIANM', 'XEFAIANW', 'EFAIANW', 'XEFASIAT',
       'EFASIAT', 'XEFASIAM', 'EFASIAM', 'XEFASIAW', 'EFASIAW', 'XEFBKAAT',
       'EFBKAAT', 'XEFBKAAM', 'EFBKAAM', 'XEFBKAAW', 'EFBKAAW', 'XEFHISPT',
       'EFHISPT', 'XEFHISPM', 'EFHISPM', 'XEFHISPW', 'EFHISPW', 'XEFNHPIT',
       'EFNHPIT', 'XEFNHPIM', 'EFNHPIM', 'XEFNHPIW', 'EFNHPIW', 'XEFWHITT',
       'EFWHITT', 'XEFWHITM', 'EFWHITM', 'XEFWHITW', 'EFWHITW', 'XEF2MORT',
       'EF2MORT', 'XEF2MORM', 'EF2MORM', 'XEF2MORW', 'EF2MORW', 'XEFUNKNT',
       'EFUNKNT', 'XEFUNKNM', 'EFUNKNM', 'XEFUNKNW', 'EFUNKNW', 'XEFNRALT',
       'EFNRALT', 'XEFNRALM', 'EFNRALM', 'XEFNRALW', 'EFNRALW '],
      dtype='object')

In [45]:
df.shape

(127757, 65)

In [46]:
df = df.drop(df.columns[[2,5,7,9,11,13,15,17,19,21,23,25,27,29,31,33,35,37,39,41,43,45,47,49,51,53,55,57,59,61,63]], axis=1)
df.head()

,UNITID,EFALEVEL,SECTION,LSTUDY,EFTOTLT,EFTOTLM,EFTOTLW,EFAIANT,EFAIANM,EFAIANW,...,EFWHITW,EF2MORT,EF2MORM,EF2MORW,EFUNKNT,EFUNKNM,EFUNKNW,EFNRALT,EFNRALM,EFNRALW
0,100654,1,3,4,6001,2429,3572,12,2,10,...,128,57,19,38,189,65,124,72,38,34
1,100654,2,3,1,5038,2134,2904,10,1,9,...,47,54,19,35,177,62,115,45,23,22
2,100654,3,3,1,4824,2038,2786,10,1,9,...,43,50,18,32,160,54,106,43,22,21
3,100654,4,3,1,1294,518,776,2,0,2,...,6,14,4,10,68,22,46,9,3,6
4,100654,5,3,1,3530,1520,2010,8,1,7,...,37,36,14,22,92,32,60,34,19,15

In [47]:
df.shape

(127757, 34)

In [48]:
df.rename(columns={'UNITID': 'ID', "EFALEVEL":'STUDENT_LEVEL','SECTION':'ATTEND_STATUS','LSSTUDY':'STUDENT_LEVEL1','EFTOTLT':'GRAND_TOTAL',
                  'EFTOTLM':'GRAND_TOTAL_MEN','EFTOTLW':'GRAND_TOTAL_WOMEN','EFNRALT':'NONRESIDENT_ALIEN_TOTAL','EFNRALM':'NONRESIDENT_MEN',
                  'EFNRALM':'NONRESDIENT_MEN','EFNRALW':'NONRESIDENT_WOMEN'},inplace=True)

In [49]:
# Upload third dataset
body = client_e0b0de43d3ed41a0a4d24ada8415e71d.get_object(Bucket='education-donotdelete-pr-lmdk4yjz3pwv2v',Key='ef2017c.csv')['Body']
# add missing __iter__ method, so pandas accepts body as file-like object
if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

df1 = pd.read_csv(body)
df1.head()

   UNITID  EFCSTATE  LINE XEFRES01  EFRES01 XEFRES02  EFRES02
0  100654         1     1        R      667        R     524.0
1  100654         5     5        R        7        R       6.0
2  100654         6     6        R       22        R      16.0
3  100654         8     8        R        4        R       3.0
4  100654        10    10        R        1        R       0.0

In [50]:
df1.shape

(39500, 7)

In [51]:
df1 = df1.drop(['LINE', 'XEFRES01', 'XEFRES02'], axis=1)
df1.head()

   UNITID  EFCSTATE  EFRES01  EFRES02
0  100654         1      667     524.0
1  100654         5        7       6.0
2  100654         6       22      16.0
3  100654         8        4       3.0
4  100654        10        1       0.0

In [52]:
df1.rename(columns={'UNITID':'ID','EFRES01':'1ST_DEG_SEEK_UND','EFRES02':'1ST_DEG_SEEK_UND_HS_12MOS'},inplace=True)

In [53]:
body = client_e0b0de43d3ed41a0a4d24ada8415e71d.get_object(Bucket='education-donotdelete-pr-lmdk4yjz3pwv2v',Key='state_mapping.csv')['Body']
# add missing __iter__ method, so pandas accepts body as file-like object
if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

state_df = pd.read_csv(body)
state_df.rename(columns={'code':'STATE_CODE', 'value':'STATE'},inplace=True)
state_df.head()

   STATE_CODE       STATE
0           1     Alabama
1           2      Alaska
2           4     Arizona
3           5    Arkansas
4           6  California

In [75]:
# Merge df1 with state_df
new_df1 = df1.merge(state_df, left_on='EFCSTATE', right_on='STATE_CODE', how='left')
new_df1.head()

       ID  EFCSTATE  1ST_DEG_SEEK_UND  EFRES02   STATE_CODE       STATE
0  100654         1               667     524.0         1.0     Alabama
1  100654         5                 7       6.0         5.0    Arkansas
2  100654         6                22      16.0         6.0  California
3  100654         8                 4       3.0         8.0    Colorado
4  100654        10                 1       0.0        10.0    Delaware

In [62]:
new_df1.rename(columns={'EFRES02':'1ST_DEG_SEEK_12MOS'},inplace=True)

In [63]:
new_df1.head()

       ID  EFCSTATE  1ST_DEG_SEEK_UND  EFRES02   STATE_CODE       STATE
0  100654         1               667     524.0         1.0     Alabama
1  100654         5                 7       6.0         5.0    Arkansas
2  100654         6                22      16.0         6.0  California
3  100654         8                 4       3.0         8.0    Colorado
4  100654        10                 1       0.0        10.0    Delaware

In [64]:
new_df1.shape

(39500, 6)

In [65]:
# Merge df1 and df2
df_merge = df.merge(new_df1, on='ID')
df_merge.head()

,ID,STUDENT_LEVEL,ATTEND_STATUS,LSTUDY,GRAND_TOTAL,GRAND_TOTAL_MEN,GRAND_TOTAL_WOMEN,EFAIANT,EFAIANM,EFAIANW,...,EFUNKNM,EFUNKNW,NONRESIDENT_ALIEN_TOTAL,NONRESDIENT_MEN,EFNRALW,EFCSTATE,1ST_DEG_SEEK_UND,EFRES02,STATE_CODE,STATE
0,100654,1,3,4,6001,2429,3572,12,2,10,...,65,124,72,38,34,1,667,524.0,1.0,Alabama
1,100654,1,3,4,6001,2429,3572,12,2,10,...,65,124,72,38,34,5,7,6.0,5.0,Arkansas
2,100654,1,3,4,6001,2429,3572,12,2,10,...,65,124,72,38,34,6,22,16.0,6.0,California
3,100654,1,3,4,6001,2429,3572,12,2,10,...,65,124,72,38,34,8,4,3.0,8.0,Colorado
4,100654,1,3,4,6001,2429,3572,12,2,10,...,65,124,72,38,34,10,1,0.0,10.0,Delaware

In [66]:
df_merge.tail()

,ID,STUDENT_LEVEL,ATTEND_STATUS,LSTUDY,GRAND_TOTAL,GRAND_TOTAL_MEN,GRAND_TOTAL_WOMEN,EFAIANT,EFAIANM,EFAIANW,...,EFUNKNM,EFUNKNW,NONRESIDENT_ALIEN_TOTAL,NONRESDIENT_MEN,EFNRALW,EFCSTATE,1ST_DEG_SEEK_UND,EFRES02,STATE_CODE,STATE
976087,491181,59,2,1,33,6,27,0,0,0,...,0,1,0,0,0,99,2,0.0,NaN,NaN
976088,491181,60,2,1,8,2,6,0,0,0,...,0,0,0,0,0,21,1,0.0,21.0,Kentucky
976089,491181,60,2,1,8,2,6,0,0,0,...,0,0,0,0,0,54,1,0.0,54.0,West Virginia
976090,491181,60,2,1,8,2,6,0,0,0,...,0,0,0,0,0,58,2,0.0,NaN,NaN
976091,491181,60,2,1,8,2,6,0,0,0,...,0,0,0,0,0,99,2,0.0,NaN,NaN

In [67]:
# should have 39 features
df_merge.shape

(976092, 39)

In [68]:
#Check for missing values
df_merge.isnull().values.any()

True

In [69]:
# How many missing values
df_merge.isnull().sum().sum()

224956

In [72]:
# Separate NaN and examine
nan_rows = df_merge[df_merge.isnull().T.any().T]

In [73]:
nan_rows.shape

(116721, 39)

In [74]:
df_merge.columns

Index(['ID', 'STUDENT_LEVEL', 'ATTEND_STATUS', 'LSTUDY', 'GRAND_TOTAL',
       'GRAND_TOTAL_MEN', 'GRAND_TOTAL_WOMEN', 'EFAIANT', 'EFAIANM', 'EFAIANW',
       'EFASIAT', 'EFASIAM', 'EFASIAW', 'EFBKAAT', 'EFBKAAM', 'EFBKAAW',
       'EFHISPT', 'EFHISPM', 'EFHISPW', 'EFNHPIT', 'EFNHPIM', 'EFNHPIW',
       'EFWHITT', 'EFWHITM', 'EFWHITW', 'EF2MORT', 'EF2MORM', 'EF2MORW',
       'EFUNKNT', 'EFUNKNM', 'EFUNKNW', 'NONRESIDENT_ALIEN_TOTAL',
       'NONRESDIENT_MEN', 'EFNRALW ', 'EFCSTATE', '1ST_DEG_SEEK_UND',
       'EFRES02 ', 'STATE_CODE', 'STATE'],
      dtype='object')